# Series

In [2]:
# len(data) should be equal to len(index)

In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
labels = ['a','b','c']

In [6]:
my_data = [10,20,30]

In [7]:
arr = np.array(my_data)

In [8]:
arr

array([10, 20, 30])

In [9]:
d = {'a':10,'b':20,'c':30}

In [10]:
d

{'a': 10, 'b': 20, 'c': 30}

In [11]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [12]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [13]:
pd.Series(data = d)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(data=labels,index=my_data)

10    a
20    b
30    c
dtype: object

In [16]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [18]:
pd.Series(my_data,my_data)

10    10
20    20
30    30
dtype: int64

In [19]:
pd.Series(d,labels) - pd.Series(d)*2

a   -10
b   -20
c   -30
dtype: int64

In [20]:
arr1 = np.arange(0,2)

In [21]:
pd.Series(arr1)

0    0
1    1
dtype: int32

In [22]:
my_list1 = [1,2,3,4]
arr2 = np.array(my_list1)

In [23]:
arr2

array([1, 2, 3, 4])

In [24]:
pd.Series(arr2)

0    1
1    2
2    3
3    4
dtype: int32

In [25]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [26]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [27]:
ser1 = pd.Series([1,2,3,4],['Mercedes','RBR','Renault','Ferrari'])

In [28]:
ser1

Mercedes    1
RBR         2
Renault     3
Ferrari     4
dtype: int64

In [29]:
ser2 = pd.Series([1,2,5,4],['Mercedes','RBR','Racing Point','Ferrari'])

In [30]:
ser2

Mercedes        1
RBR             2
Racing Point    5
Ferrari         4
dtype: int64

In [31]:
ser1['Mercedes']

1

In [32]:
num1 = ser1[ser1[ser2[ser1['Mercedes']]]]-1

In [33]:
ser2[num1]

4

In [34]:
ser1 + ser2

Ferrari         8.0
Mercedes        2.0
RBR             4.0
Racing Point    NaN
Renault         NaN
dtype: float64

# DataFrames

In [35]:
import numpy as np
import pandas as pd

In [36]:
from numpy.random import randn

In [37]:
np.random.seed(101)

In [38]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [39]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Columns

In [42]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [43]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [44]:
type(df['W'])

pandas.core.series.Series

In [46]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [48]:
#df['new']

In [49]:
df['new'] = df['W'] + df['Z']

In [50]:
df['new']

A    3.210676
B    1.257083
C   -2.607169
D    1.143752
E    0.874303
Name: new, dtype: float64

In [51]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [52]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [54]:
df.drop('new',axis=1,inplace=True)

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [59]:
df.drop('E',axis=0,inplace=True)

In [60]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [63]:
# Selecting Rows

In [64]:
df.shape

(4, 4)

In [67]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [73]:
df.loc[['A','B']][['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965

In [79]:
df.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [80]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [81]:
df.iloc[1] + df.iloc[2]

W   -1.367050
X    0.420804
Y   -0.319263
Z    0.016965
dtype: float64

In [82]:
df.iloc[1,2]

-0.8480769834036315

In [85]:
df.loc['B','Y']

-0.8480769834036315

In [86]:
df.loc[['A','B'],['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [88]:
df.loc[['A','B']][['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [89]:
type(df.loc[['A','B'],['W','X']])

pandas.core.frame.DataFrame

In [95]:
type(df.loc[['A','B']][['W','X']])

pandas.core.frame.DataFrame

# DataFrames Part II

In [51]:
import numpy as np
import pandas as pd

In [52]:
from numpy.random import randn

In [53]:
np.random.seed(101)

In [54]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [14]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [15]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [16]:
df < 0

       W      X      Y      Z
A  False  False   True   True
B   True  False  False  False
C  False  False  False  False
D   True   True   True  False
E   True  False  False  False

In [18]:
df == 0

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False

In [23]:
booldf_gt = df > 0

In [24]:
df[booldf_gt]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [25]:
booldf_lt = df <  0

In [27]:
df[booldf_lt]

          W        X         Y         Z
A       NaN      NaN -1.706086 -1.159119
B -0.134841      NaN       NaN       NaN
C       NaN      NaN       NaN       NaN
D -0.497104 -0.75407 -0.943406       NaN
E -0.116773      NaN       NaN       NaN

In [30]:
booldf_gt & booldf_lt

       W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False

In [31]:
booldf_gt | booldf_lt

      W     X     Y     Z
A  True  True  True  True
B  True  True  True  True
C  True  True  True  True
D  True  True  True  True
E  True  True  True  True

In [32]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [34]:
df[df['Z']<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [35]:
result_df = df[df['Z']<0]

In [36]:
result_df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [37]:
result_df['W']

A    0.302665
Name: W, dtype: float64

In [38]:
df[df['Z']<0]['W']

A    0.302665
Name: W, dtype: float64

In [39]:
df[df['Z']<0][['W','X']]

          W         X
A  0.302665  1.693723

In [42]:
df[(df['W']>0) & (df['X']>0)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [45]:
df[(df['W']>0) | (df['X']>1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [46]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [47]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [48]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [49]:
df.reset_index(inplace=True)

In [50]:
df

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [55]:
# index reset removed

In [56]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
new_indx = 'NY CA TX NC FL'.split()

In [58]:
new_indx

['NY', 'CA', 'TX', 'NC', 'FL']

In [59]:
df['States'] = new_indx

In [60]:
df['States']

A    NY
B    CA
C    TX
D    NC
E    FL
Name: States, dtype: object

In [62]:
# new column added to DataFrame - 'States'

In [63]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     NY
B  0.651118 -0.319318 -0.848077  0.605965     CA
C -2.018168  0.740122  0.528813 -0.589001     TX
D  0.188695 -0.758872 -0.933237  0.955057     NC
E  0.190794  1.978757  2.605967  0.683509     FL

In [65]:
df.set_index('States')

               W         X         Y         Z
States
NY      2.706850  0.628133  0.907969  0.503826
CA      0.651118 -0.319318 -0.848077  0.605965
TX     -2.018168  0.740122  0.528813 -0.589001
NC      0.188695 -0.758872 -0.933237  0.955057
FL      0.190794  1.978757  2.605967  0.683509

# DataFrames  Part III

In [66]:
import numpy as np
import pandas as pd

In [67]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [76]:
mod_index = list(zip(outside,inside))

In [77]:
mod_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [78]:
mod_index = pd.MultiIndex.from_tuples(mod_index)

In [79]:
mod_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [80]:
type(mod_index)

pandas.core.indexes.multi.MultiIndex

In [83]:
df = pd.DataFrame(randn(6,2),mod_index,['A','B'])

In [84]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [86]:
df.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [87]:
df.loc['G2']

          A         B
1  0.238127  1.996652
2 -0.993263  0.196800
3 -1.136645  0.000366

In [89]:
df.iloc[0]

A   -0.497104
B   -0.754070
Name: (G1, 1), dtype: float64

In [90]:
df.iloc[1]

A   -0.943406
B    0.484752
Name: (G1, 2), dtype: float64

In [93]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [96]:
df.loc['G1'].iloc[1]

A   -0.943406
B    0.484752
Name: 2, dtype: float64

In [97]:
df.loc['G1'].iloc[0]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [98]:
df.index.names

FrozenList([None, None])

In [99]:
df.index.names = ['Groups', 'Num']

In [101]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [144]:
df.loc['G2'].loc[2,'B']

0.19679950499134005

In [145]:
df.loc['G2'].loc[2]['B']

0.19679950499134005

In [147]:
df.loc['G1'].loc[3]['B']

1.9017547952605123

In [148]:
df.xs('G1')

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [149]:
df.xs('G2')

            A         B
Num
1    0.238127  1.996652
2   -0.993263  0.196800
3   -1.136645  0.000366

In [161]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

In [162]:
df.xs(2,level='Num')

               A         B
Groups
G1     -0.943406  0.484752
G2     -0.993263  0.196800

In [163]:
df.xs(3,level='Num')

               A         B
Groups
G1     -0.116773  1.901755
G2     -1.136645  0.000366